{
  "Title": "Slugrot",
  "Description": "Play as the Slugrot, a fusion of the Rot and a slugcat who found themselves in a bad position, at a bad time.\nOr perhaps, the perfect place at just the right time...\r\n\r\n[b]Credit to Lurzard on the official RW discord for all the amazing art![/b]\r\n\r\nThis campaign currently uses the Rivulet world state from slugbase, so some things like the 5P conversation will not work as intended. You start off with max karma unlocked, so theoretically you can still get an ascension ending.\r\n\r\nThis is very much a beta release, since it is varying levels of unfinished and, I am sure, full of bugs. I have a lot of ideas that would take a lot more time to implement, and wanted to finally just put [i]something[/i] up, so this is what I decided to do.\r\nIf you encounter any bugs with this character at all, tell me so I can eventually fix them :)\r\n\r\nCurrent controls (Sadly still hardcoded, will make some of them custom bindable very soon):\r\nWhile holding down the grab/eat input (yes, this is really uncomfortable, will be changed ASAP), use WASD or arrow keys to move a single tentacle to a wall. Once it makes contact, you can then lift yourself into the air and move around freely, as long as at least one tentacle still grips a surface. Move using the normal movement keys, and the tentacles will automatically target positions on hard surfaces or poles in front of the player to attach to. You can also use WASD to manually assume control of which direction the tentacles will target, which is useful when traversing open areas that don\u0027t have walls in all directions where you could want to move.\r\n\r\nKnown errors/bugs in no particular order (may add more as I remember them/they come up):\r\n- No multiplayer arena/jolly portraits\r\n- No ascension portrait\r\n- Haven\u0027t tested it with jolly, so that may be wonk (and likely is thanks to some of the extra inputs \u002B their hardcodedness)\r\n- The 5P conversation will keep playing no matter how far you go, it is likely assumed you cannot escape when playing as Rivulet\r\n- Some graphical issues may occur with the tentacles sometimes\r\n- Tentacles can sometimes [i]stretch[/i] much further then they are supposed to be able to\r\n- The custom color for \u0027Rot Eyes\u0027 does nothing, resulting in the tentacles and \u0027X\u0027 sprites always being blue\r\n- The face will flip which side the bad eye is on when changing direction (It is supposed to stay on the right side)\r\n- Sometimes when trying to use the tentacles for the first time, they will jump off the surface by a little bit\r\n- Not really a bug or error, but related to something I want to implement soon to make life a bit easier, all rot cysts will still target you like a normal slugcat. No friendly rot today :(\r\n- It will spit out an error every time you go through a pipe, but this is expected. Let me know if it causes a crash though\r\n- Tentacles are very excited at the beginning of a cycle, and flail around a bit\r\n- Animation for having tentacles appear could be smoother",
  "ID": "rotcat",
  "Version": "0.0.1",
  "TargetGameVersion": "v1.9.06",
  "Requirements": "slime-cubed.slugbase",
  "RequirementNames": "Slugbase",
  "Authors": "Art: Lurzard\nCode: MoonWatcher610",
  "Visibility": "Unlisted",
  "Tags": [
    "Campaigns"
  ],
  "WorkshopID": 2952590208,
  "UploadFilesOnly": false
}